Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: སྟོང་པ་ཉིད་ལ་མོས་པ་དང་། མཚན་མ་མེད་པ་ལ་ཡིད་ཆེས་པ་དང་། སྨོན་པ་མེད་པ་ལ་སོམ་ཉི་མེད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ལ་དེ་ཁོ་ནའི་བློ་དང་ལྡན་པ་དང་། ཤིན་ཏུ་མི་རྟག་པ་ཉིད་དང་།
en: They are: devotion to emptiness, trust in signlessness, confidence in wishlessness, the mind exclusively absorbed in the unconditioned, and utter impermanence.

source: གཟུགས་དབུབ་དང་མཚུངས་པ་ཉིད་དང་། ཚོར་བ་ཆུ་བུར་དང་འདྲ་བ་ཉིད་དང་། འདུ་ཤེས་སྨིག་རྒྱུ་དང་མཚུངས་པ་སྟེ་གཉིས་སུ་མེད་པ་ཉིད་དང་། འདུ་བྱེད་རྣམས་ལ་ཆུ་ཤིང་དང་མཚུངས་པར་སོ་སོར་རྟོག་པ་དང་། རྣམ་པར་ཤེས་པ་སྒྱུ་མ་ལྟ་བུའི་ཆོས་ཉིད་དང་། ཁམས་རྣམས་གཡོ་བ་མེད་པ་ཉིད་དང་། སྐྱེ་མཆེད་རྣམས་ཕན་ཚུན་དུ་ཤེས་པ་མེད་པ་ཉིད་དང་། སེམས་གནས་པ་མེད་པ་དང་།
en: They are: the contemplations on how form is similar to bubbles, how feeling is similar to bubbles, how perception is nondual and similar to visual distortions, how formations are like the plantain tree, how consciousness is illusory, how the elements are unmoving, how the sense faculties are without mutual knowing, and how the mind has no basis.

source: ང་རྒྱལ་ཡིད་ལ་མི་བྱེད་པ་དང་། ལྷག་པར་བྱེད་པ་ལྷག་པར་མི་བྱེད་པ་དང་། མཉམ་པ་ཉིད་ལ་མཉམ་པ་ཉིད་དུ་རྟོགས་པ་དང་། ཐ་དད་དུ་བྱ་བ་མེད་པ་དང་། རོ་གཅིག་པ་དང་། བགྲོད་པ་གཅིག་པུའི་ལམ་ལ་རབ་ཏུ་གནས་པ་དང་། ལམ་གྱི་ཚོགས་ཤེས་པ་ཡོངས་སུ་ཚོལ་བ་དང་། ངེས་པའི་དོན་གྱི་དོན་ལ་རྟོན་པ་དང་། དོན་གྱི་རྗེས་སུ་ཞུགས་པའི་བློ་དང་། སྐད་ཐམས་ཅད་ལ་སྐད་མེད་པར་འཇུག་པ་དང་། སྒྲ་ཐམས་ཅད་ལ་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པར་ཤེས་པ་དང་། དོན་དང་ཚིག་འབྲུ་གཉིས་སུ་མེད་པ་ལ་འཇུག་པ་ཤེས་པས་དོན་བརྗོད་དུ་མེད་པར་རྟོགས་པ་དང་།
en: “They are: not engaging in pride, not thinking oneself superior, realizing sameness to be sameness, the absence of multiplicity, one taste, staying on the path with a single destination, seeking knowledge of the accumulations on the path, relying on the truth of the definitive meaning, the mind that follows the truth, engaging without language in all languages, knowing that no sound relates to the past or the future, and realizing the inexpressible meaning with the knowledge of how meaning and expression are beyond duality.

source: སྡུག་བསྔལ་ཤེས་པ་ངར་འཛིན་པ་མེད་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ཤིན་ཏུ་ཟད་པ་དང་། འགོག་པ་ཤེས་པ་སྒྲོ་བཏགས་པ་མེད་པ་དང་། ལམ་ཤེས་པ་འདུས་བྱས་དང་། འདུས་མ་བྱས་མཉམ་པ་ཉིད་དུ་འཇུག་པ་དང་།
en: “They are: knowledge of suffering—being without self-clinging; knowledge of origin—bringing it to complete exhaustion; knowledge of cessation—being without conceptual impositions; and knowledge of the path—penetrating the sameness of the conditioned and the unconditioned.

source: ལུས་ལ་ཞུགས་པའི་དྲན་པ་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐར་འཕོ་བ་མེད་པ་དང་། ཚོར་བ་ལ་ཞུགས་པའི་དྲན་པ་སྐྱེ་བ་དང་འཇིག་པར་མི་གནས་པ་དང་། སེམས་ལ་ཞུགས་པའི་དྲན་པ་དམིགས་པ་ལ་ཤིན་ཏུ་བརྟགས་པ་དང་། ཆོས་ལ་ཞུགས་པའི་དྲན་པ་ཆོས་ཀྱི་དབྱིངས་ལ་མ་ཡིན་པ་དང་།
en: “They are: mindfulness that considers the body and how it does not transfer from the past to the future, mindfulness that considers sensations and how they do not exist in terms of birth and destruction, mindfulness that considers the mind and how it fabricates reference points, and mindfulness that considers phenomena and how they are not the realm of phenomena.

source: ཡང་དག་པར་སྤོང་བ་མཉམ་པས་མཉམ་པ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་སེམས་ལ་དབང་སྒྱུར་བར་གྱུར་པ་དང་།
en: “They are: right abandonment and utter sameness, and the bases of miracles and how one gains power over the mind.

source: དད་པའི་དབང་པོ་ཆགས་པ་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་པ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དབེན་པས་ངེས་པར་བྱུང་བ་དང་། དྲན་པའི་དབང་པོ་དྲན་པ་མེད་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་ཡིད་ལ་བྱེད་པ་མེད་པ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་སྤྲོས་པ་ལས་ཤིན་ཏུ་འདས་པ་དང་།
en: “They are: the faculty of faith and how all desire is transcended, the faculty of diligence and how one escapes through isolation, the faculty of mindfulness and how it is without mindfulness, the faculty of absorption and how it refrains from mental engagement, and the faculty of insight and how it transcends conceptual elaborations.

source: དད་པའི་སྟོབས་གཞན་གྱི་དྲིང་མི་འཇོག་པ་དང་། བརྩོན་འགྲུས་ཀྱི་སྟོབས་དམིགས་པ་རྟོགས་པ་མེད་པ་དང་། དྲན་པའི་སྟོབས་ཉམས་པ་མེད་པ་དང་ལྡན་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ངེས་པར་སེམས་པར་གྱུར་པ་དང་། ཤེས་རབ་ཀྱི་སྟོབས་མི་འཁྲུགས་པའི་རྒྱུ་འཐུན་པ་དང་།
en: “They are: the strength of faith and how it is not led along by others, the strength of diligence and how it does not conceive a narrow focus, the strength of mindfulness and how it does not decline, the strength of absorption and how it contemplates with certainty, and the strength of insight and how it accords with an unshakable cause.

source: དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དྲན་པ་མེད་ཅིང་བརྗེད་པ་མེད་པ་དང་། ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་འཇུག་པ་དང་། བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ལེན་པ་མེད་ཅིང་འདོར་བ་མེད་པ་དང་། དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དབའ་རླབས་མེད་པ་དང་། རབ་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ལུས་དང་སེམས་ལ་ཞུགས་པ་དང་། ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པ་དང་། བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གཉིས་དང་བྲལ་བ་དང་།
en: “They are: the branch of awakening of mindfulness and how it neither recalls nor forgets, the branch of awakening of discrimination and how it understands the sameness of all phenomena, the branch of awakening of diligence and how it neither takes up nor avoids anything, the branch of awakening of joy and how it does not vacillate, the branch of awakening of pliancy and how it is present in body and mind, the branch of awakening of absorption and how it masters sameness, and the branch of awakening of equanimity and how it is nondual.

source: ཡང་དག་པའི་ལྟ་བ་ལྟ་བ་ཐམས་ཅད་སྤོང་བ་དང་། ཡང་དག་པའི་རྟོག་པ་རྟོག་པ་དང་རྣམ་པར་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་དང་བྲལ་བ་དང་། ཡང་དག་པའི་ངག་སྒྲ་སྐད་ཐམས་ཅད་མཉམ་པ་ཉིད་ལ་འཇུག་པ་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་ལུས་དང་། སེམས་ཀྱི་ལས་དང་བྲལ་བ་དང་། ཡང་དག་པའི་འཚོ་བ་ཚོལ་བ་ཐམས་ཅད་རྒྱུན་བཅད་པ་དང་། ཡང་དག་པའི་རྩོལ་བ་འདེག་པ་མེད་ཅིང་འཇོག་པ་མེད་པ་དང་། ཡང་དག་པའི་དྲན་པ་དགེ་བ་དང་མི་དགེ་བའི་རྣམ་པར་རིག་པ་ལ་མི་འཇུག་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་སེམས་ཀྱི་དམིགས་པ་མཉམ་པ་ཉིད་ལ་འཇུག་པ་དང་།
en: “They are: right view and how it relinquishes all views; right thought and how it is beyond thought, concepts, and reasoning; right speech and how it realizes the sameness of all language and sound; right action and how it is beyond all physical and mental action; right livelihood and how it puts an end to all striving; right effort and how it neither undertakes nor abstains from anything; right mindfulness and how it does not conceive of virtue or nonvirtue; and right absorption and how it realizes the sameness of all mental reference points.

source: ཞི་བ་ཞི་གནས་ཀྱི་མཐར་སོང་བ་དང་། ལྷག་མཐོང་ལྟ་བ་རྣམ་པར་དག་པ་དང་།
en: “They are: reaching the culmination of peaceful tranquility and purifying the view of special insight.

source: སྐྱེ་བ་མེད་པའི་དོན་མི་རྟག་པའི་དོན་དང་། གདོད་མ་ནས་སྐྱེ་བ་མེད་པའི་དོན་སྡུག་བསྔལ་གྱི་དོན་དང་། རྒྱུ་བ་མེད་པའི་དོན་བདག་མེད་པའི་དོན་དང་། ཉེ་བར་ཞི་བའི་དོན་ཞི་བའི་དོན་དང་།
en: “They are: the meaning of the unborn, the meaning of impermanence, the meaning of the primordially unborn, the meaning of suffering, the meaning of stillness, the meaning of selflessness, the meaning of pacification, and the meaning of peace.

source: དུལ་བས་སྦྱིན་པ་དང་། བསིལ་བའི་དངོས་པོར་གྱུར་པའི་ཚུལ་ཁྲིམས་དང་། ཟད་པའི་ཆོས་དང་ལྡན་པའི་བཟོད་པ་དང་། ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བས་རྣམ་པར་འབྱེད་པའི་བརྩོན་འགྲུས་དང་། ནད་ཉེ་བར་ཞི་བའི་བསམ་གཏན་དང་། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་པའི་མཚན་ཉིད་ཀྱི་ཤེས་རབ་དང་།
en: “They are: generosity that is gentle, discipline that cools, patience that has the property of exhaustion, diligence that fully discriminates, concentration that pacifies affliction, and insight that accurately knows the nature of things.

source: སེམས་ཅན་གདོད་མ་ནས་རྣམ་པར་དག་པའི་བྱམས་པ་དང་། ནམ་མཁའ་དང་མཚུངས་པའི་སྙིང་རྗེ་དང་། དགའ་བ་མེད་པའི་དགའ་བ་དང་། རྩོད་པ་ཐམས་ཅད་རྒྱུན་བཅད་པའི་བཏང་སྙོམས་དང་།
en: “They are: love that is primordially pure toward all beings, compassion that is vast as space, joy that is beyond joy, and equanimity that ends all strife.

source: ཆོས་ཐམས་ཅད་འཁོར་གསུམ་ཡོངས་སུ་དག་པ་དང་། སྔོན་གྱི་མཐའ་ནས་སྟོང་པ་དང་། ཕྱི་མའི་མཐར་དབེན་པ་དང་། ད་ལྟར་བྱུང་བ་ན་བདག་མེད་པའོ། །
en: “They are: how all phenomena are pure of the three spheres, the emptiness of the past, the isolation of the future, and the lack of self in the present.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟར་གང་ཆོས་ཟབ་མོ་རྒྱུན་ཆད་པ་ཚིག་འབྲུ་དང་བྲལ་བ་ནམ་མཁའ་དང་མཚུངས་པ།
en: “Sāgaramati, these profound subjects are discontinuous, beyond linguistic description, and like space.

source: འདི་ལྟ་བུ་འདི་དག་རྟོགས་པ་དང་ཁོང་དུ་ཆུད་པ་དང་འཇུག་པ་ཤེས་པ་ལ་དཔྱོད་པ་དང་། སེམས་པ་དང་འཇལ་བ་དང་བགྲང་བ་དང་། ཉེ་བར་རྟོག་པ་དང་ནན་ཏན་བྱེད་པ་འདི་ནི་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་དེ་འབིགས་པའོ། །
en: To realize, understand, engage, investigate, contemplate, assess, quantify, reflect upon, and diligently inquire into these phenomena is to internalize the jewel that develops the mind directed toward omniscience.

source: དེ་ལྟར་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་དེ་ཕིགས་ན། ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་བ་ཉིད་ལྷུན་གྱིས་གྲུབ་པ་ཉིད་དུ་འཐོབ་པར་འགྱུར་རོ། །
en: When one internalizes the jewel that develops the mind directed toward omniscience in this manner, one will spontaneously gain dominion over all phenomena.

source: ཟླ་བ་དང་ཉི་མའི་གཞལ་མེད་ཁང་ལྷུན་གྱིས་གྲུབ་པར་རྣམ་པར་རྒྱུ་ཞིང་འཛམ་བུའི་གླིང་ཐམས་ཅད་དུ།
en: The celestial mansions of the sun and the moon move naturally and thus illuminate all of Jambudvīpa.

source: སྣང་བར་བྱེད་ཀྱང་ལྷའི་བུ་ཉི་མ་དང་ཟླ་བ་འདི་སྙམ་དུ་བདག་ཅག་འགྲོའམ་འོན་ཏེ་ལྡོག་སྙམ་དུ་མི་སེམས་པར་སེམས་ཅན་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པས་དེ་དག་འགྲོའོ། །
en: However, these gods—the sun and the moon—do not conceptualize that ‘we would like to proceed or recede.’ Rather, they proceed solely due to the ripening of beings’ merit.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་བཞིན་དུ་རབ་ཏུ་ཕིགས་པའི་ཤེས་པ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ལྷུན་གྱིས་གྲུབ་པར་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པ་དག་ན་
en: Likewise, Sāgaramati, bodhisattva great beings who have internalized this knowledge enact the benefit of beings naturally in immeasurable buddha realms.

source: སེམས་ཅན་གྱི་དོན་བྱེད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཡང་མངོན་པར་འདུ་བྱེད་པ་མེད་པར་བྱ་བ་དེ་དག་ཀུན་ཏུ་སྟོན་ཏོ། །
en: However, these bodhisattva great beings display these acts without performing any conditioned action.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་འབིགས་པ་ཤེས་པ་གང་ཡིན་པ་དེ་ནི། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པར་ཡོངས་སུ་བཙལ་བར་བྱའོ། །
en: “In this manner, Sāgaramati, the internalized knowledge of bodhisattva great beings seeks out the perfections of concentration and insight.

source: བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པར་བཞག་ན་ལྷག་མཐོང་གི་ཆོས་རྣམས་མཐོང་གི་མཉམ་པར་མ་བཞག་པས་ནི་མ་ཡིན་ནོ། །
en: When bodhisattvas rest in equipoise, they see the phenomena of special insight, yet when they are not resting in equipoise they do not.

source: དེའི་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ། ཤེས་རབ་དེས་མངོན་སུམ་དུ་འགྱུར་རོ། །
en: This type of vision is insight, and insight functions to make it evident.

source: གང་མངོན་སུམ་དུ་འགྱུར་ཞེ་ན།
en: What does it make evident?

source: ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ལ་མངོན་སུམ་དུ་འགྱུར་རོ། །
en: It makes the true character of all phenomena evident.

source: ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་གང་ཞེ་ན།
en: What is the true character of all phenomena?

source: མཚན་ཉིད་ཀྱི་གཞི་དེ་ལ་ཀུན་ཏུ་མི་སྤྱོད་པའོ། །
en: It is devoid of any engagement with the basis of the character.

source: ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་ཀྱི་གཞི་གང་ཞེ་ན།
en: What is the basis of the character of all phenomena?

source: འདི་ལྟ་སྟེ་རྣམ་པར་རིག་པ་ནི་ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་ཀྱི་གཞིའོ། །
en: Cognizance is the basis of the character of all phenomena.

source: རྣམ་པར་རིག་པ་དེའི་ཡང་དག་པ་ཇི་ལྟ་བའི་མཚན་ཉིད་གང་ཡིན་པ་དེ་ཉིད་ནི་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ཅེས་བྱའོ། །
en: The true character of this cognizance is said to be the true character of all phenomena.

source: གང་གི་ཚེ་ཚོར་བ་ཐམས་ཅད་རྒྱུན་བཅད་པར་གྱུར་པ་དེའི་ཚེ་སྣང་བར་ཡང་མི་བྱེད། མི་སྣང་བར་མི་བྱེད་དོ། །
en: “When the continuity of all feeling is cut, there is no experience nor nonexperience.

source: དེ་ལ་སྣང་བ་ནི་གང་། མི་སྣང་བ་ནི་གང་ཞེ་ན།
en: In this context, what are experience and nonexperience?

source: སྣང་བ་ཞེས་བྱ་བ་ནི་སྐྱེ་བའོ། །
en: What we are calling experience is birth.

source: མི་སྣང་བ་ཞེས་བྱ་བ་ནི་འགག་པའོ། །
en: What we are calling nonexperience is cessation.

source: གང་གི་ཚེ་སྣང་བར་ཡང་མི་བྱེད་མི་སྣང་བར་ཡང་མི་བྱེད་པ་དེའི་ཚེ། སྐྱེ་བར་ཡང་མི་བྱེད་འགག་པར་ཡང་མི་བྱེད་དོ། །
en: When one undergoes neither experience nor nonexperience, one also undergoes neither birth nor cessation.

source: གང་གི་ཚེ་སྐྱེ་བར་ཡང་མི་བྱེད་འགག་པར་ཡང་མི་བྱེད་པ་དེའི་ཚེ་ཆོས་ཉིད་ལ་གནས་པ་ཡིན་ཏེ་ཆོས་ཀྱི་དབྱིངས་འཁྲུགས་པར་མི་བྱེད། དེ་བཞིན་ཉིད་ལས་མི་གཡོ། ཡང་དག་པའི་མཐའ་འཇིག་པར་མི་བྱེད་དོ། །
en: When one undergoes neither birth nor cessation, one settles in reality, does not disturb the realm of phenomena, does not vacillate from suchness, and does not destroy the limit of reality.

source: དེ་ལ་ཆོས་ཀྱི་དབྱིངས་ཞེས་བྱ་བ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྗེས་སུ་རྟོགས་པའོ། །
en: What we are calling the realm of phenomena is realized as dependent origination.

source: དེ་བཞིན་ཉིད་ནི་དེ་ཁོ་ནའི་མཚན་ཉིད་ཁོང་དུ་ཆུད་པའོ། །
en: Suchness is to understand thusness.

source: ཡང་དག་པའི་མཐའ་ནི་གཉིས་སུ་མེད་པའི་ཡང་དག་པར་མངོན་པར་རྟོགས་པའོ། །
en: The limit of reality is to realize true nonduality.

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟར་མངོན་སུམ་དུ་ཤེས་པ་རིག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤིན་ཏུ་ཕིགས་པ་ཤེས་པ་ཞེས་བྱའོ། །སྦྱང་བ་དང་གནོད་པ་དང་ངེས་པར་འབིགས་པའི་ལེའུ་འདི།
en: “Sāgaramati, bodhisattva great beings who cognize this knowledge directly are said to have reached full internalization of knowledge.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་པའི་ཚེ། ལྷ་དང་མིའི་སྐྱེ་དགུའི་སྲོག་ཆགས་ཁྲག་ཁྲིག་ཕྲག་བཅུ་གཉིས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །སྲོག་ཆགས་ཁྲི་དྲུག་སྟོང་གིས་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: When the Blessed One gave this teaching on training, adversity, and internalization, one trillion two hundred billion gods and humans developed the mind directed toward unsurpassed and perfect awakening, while six hundred thousand beings gained acceptance.

source: ཆོས་ཀུན་ངེས་པར་རྟོགས་པ་ཡི། །བྱང་ཆུབ་སེམས་ནི་སྒྲོགས་པར་བྱེད། །
en: “The mind of awakening That realizes all phenomena is proclaimed.

source: དེ་ཚེ་དེས་རྟོགས་ཡེ་ཤེས་ཀྱིས། །ཆོས་རྣམས་ཀུན་ལ་ཆགས་པ་མེད། །
en: At that point the wisdom of realization Finds no attachment to any phenomena.

source: ཟབ་མོའི་ཆོས་རྣམས་ཁོང་དུ་ཆུད། །མཁས་པ་སྐྲག་པར་འགྱུར་བ་མེད། །
en: “When the learned ones master profound subjects They lose all their anxiety.

source: སྐྲག་མེད་ཀུན་ཏུ་འཇིགས་མེད་པས། །ཁྱད་པར་འཕགས་པར་འགྱུར་བ་ཡིན། །
en: With no anxiety or fear, They proceed to greater nobility.

source: རྒྱུ་ལ་དམིགས་པའི་ཚུལ་གྱིས་ནི། །བརྟེན་པའི་ཆོས་རྣམས་ཁོང་དུ་ཆུད། །
en: “With the manner of focusing on causes, One understands dependent phenomena.

source: ཤེས་རབ་ལྡན་དེ་རྗེས་འཐུན་བྱེད། །མཐའ་ལྟ་བ་ནི་མི་འཛིན་ཏོ། །
en: The knowledgeable are then in agreement In that extreme views are not to be held.

source: རྟག་པ་དང་ནི་ཆད་པ་ལ། །བློ་ནི་ཐོགས་པ་ཡོད་མ་ཡིན། །
en: “The mind will not get caught in Either eternalism or nihilism.

source: ཡང་དག་མཐའ་ནི་བསམ་ཡས་པའི། །དབུ་མའི་མཐའ་ནི་རྟོགས་པར་འགྱུར། །
en: The unfathomable limit of reality, The middle limit, will be realized.

source: བདག་གིས་མཐའ་ཡི་རང་བཞིན་གྱིས། །ཆོས་རྣམས་བདག་མེད་ངོ་བོ་ཉིད། །ཆོས་ཀུན་དེ་ཡི་རང་བཞིན་ཏེ། །གདོད་ནས་མ་སྐྱེས་འགག་པ་མེད། །
en: According to me, the nature of this limit entails That all phenomena are of the essence of selflessness. The nature of all phenomena Is primordially unborn and unceasing—

source: སྐྱེས་པ་མེད་ཅིང་འབྱུང་བ་མེད། །སྟོང་པ་གཟུང་མེད་དྲི་མ་མེད། །མཚན་མ་མེད་ཅིང་སྤྲོས་པ་མེད། །ནམ་མཁའ་དང་ནི་མཚུངས་ཤིང་འདྲ། །
en: “Unborn, non-arising, Empty, ungraspable, immaculate, Signless, nonconceptual, Alike and akin to space.

source: དེ་དག་སེམས་ཀྱིས་མི་སྨོན་པར། །འདོད་ཅིང་ཆགས་པ་རྣམ་པར་སྤངས། །
en: “When the mind does not hope for any of these, Desire and attachment are relinquished.

source: གཟུགས་ཀྱི་རང་བཞིན་མངོན་སུམ་དུ། །དབུབ་ལྟ་བུར་རབ་ཏུ་ཤེས། །
en: The nature of form is directly understood As being like a bubble.

source: ཚོར་བ་ཆུ་བུར་འདྲ་བ་སྟེ། །འདུ་ཤེས་སྨིག་རྒྱུའི་མཚན་ཉིད་དོ། །
en: “Feeling is like bubbles and Perception has the quality of a visual distortion.

source: འདུ་བྱེད་ཆུ་ཤིང་སྙིང་པོ་འདྲ། །རྣམ་པར་ཤེས་པ་སྒྱུ་མ་འདྲ། །
en: Formations are like the core of a plantain tree, And consciousness is like an illusion.

source: ཁམས་བཞི་གཡོ་བ་མེད་པ་སྟེ། །ནམ་མཁའ་མཚུངས་པའི་ཁམས་ཡིན་ནོ། །
en: “The four elements undergo no motion, Like the element of space.

source: གང་དག་སྐྱེ་མཆེད་ཐམས་ཅད་ནི། །བེམས་པོ་ཕན་ཚུན་སྤྱོད་ཡུལ་ལོ། །
en: The sense sources Are material substances and are each other’s referents.

source: སེམས་ནི་ནང་ན་མ་ཡིན་ཏེ། །ཕྱི་རོལ་དུ་ཡང་མི་དམིགས་སོ། །
en: “Mind is not within And cannot be observed without.

source: ཡིད་ལ་ང་ཡི་ཡོད་མ་ཡིན། །
en: For the mind there is no ‘mine.’

source: རྣམ་པར་ཤེས་པ་གནས་པ་མེད། །
en: Consciousness does not exist anywhere.

source: ཆོས་རྣམས་ཡིད་ལ་མི་བྱེད་དེ། །ལྷག་པར་བྱེད་པ་རྣམ་པར་སྤོང་། །
en: “When phenomena are not mentally engaged, Self-aggrandizement is eliminated.

source: ཆོས་རྣམས་ཐམས་ཅད་མཉམ་ཉིད་དུ། །ཡང་དག་ཉིད་དུ་ཁོང་དུ་ཆུད། །
en: Everything is truly mastered as sameness And as truth itself.

source: ཐ་དད་མེད་ཅིང་རོ་གཅིག་སྟེ། །གཅིག་པུ་བགྲོད་ལམ་མཉམ་པ་ཉིད། །
en: “It is not various, but a single taste, Singular, and traversing a path of sameness.

source: ལམ་གྱི་ཤེས་པ་རབ་ཏུ་རྟོགས། །ངེས་པའི་དོན་གྱི་དོན་རྣམས་མཐོང་། །
en: Thus the path consciousness is realized, And the significance of the true meaning is seen.

source: བློ་ནི་དོན་གྱི་རྗེས་སུ་ཞུགས། །སྐད་ནི་སྐད་མེད་ཁོང་དུ་ཆུད། །
en: “Mind realizes the meaning, And masters the fact that language lacks language.

source: སྒྲ་རྣམས་ཀུན་ལ་སྔོན་མཐའ་དང་། །ཕྱི་མའི་མཐའ་མར་ཡོངས་སུ་གཅོད། །
en: Sounds do not continue, From the past to the future.

source: དོན་དང་ཚིག་འབྲུ་རྣམས་ལ་མཁས། །ཆོས་རྣམས་གཉིས་སུ་མེད་པར་རྟོགས། །
en: “Those who are learned in both meaning and words Realize all phenomena to be nondual.

source: བརྗོད་དུ་མེད་པའི་དོན་ལ་ནི། །འདི་ཉིད་ཡང་དག་ཁོང་དུ་ཆུད། །
en: This inexpressible meaning Is realized authentically.

source: སྐྱེ་བ་མེད་པར་སྡུག་བསྔལ་ཤེས། །
en: “Suffering is known to be unborn;

source: ཀུན་འབྱུང་བ་ལ་མཉམ་པའི་བློ། །
en: Origin is the mind of sameness;

source: འགོག་པ་ཤེས་པ་ཟད་པར་བསྟན། །
en: Cessation is taught to be the cessation of consciousness;

source: ལམ་ཤེས་པ་ནི་འདུས་མ་བྱས། །
en: And the path is unconditioned knowledge.

source: ལུས་དང་ཚོར་བ་སེམས་དང་ནི། །ཆོས་ལ་ཆོས་སུ་རྗེས་སུ་རྟོགས། །
en: “Body, feeling, mind, And phenomena are realized as Dharma.

source: དྲན་མེད་ཡིད་ལ་བྱེད་མེད་པའི། །དྲན་པ་ཉེ་བར་གཞག་པ་སྟོན། །
en: The foundation of mindfulness is shown To be without mindfulness and nonconceptual.

source: ཆོས་ཀྱི་དབྱིངས་ནི་དབྱིངས་མིན་པར། །
en: “The realm of phenomena is not a realm.

source: ཡང་དག་ཉིད་ནི་མཉམ་པས་མཉམ། །
en: Truth is equalized through sameness.

source: སྤོང་བས་སྤང་དུ་མེད་པ་ནི། །ཡང་དག་སྤོང་བར་རབ་ཏུ་བསྟན། །
en: Abandonment does not abandon anything— Thus is true abandonment taught.

source: སེམས་ལ་དབང་ནི་ཐོབ་པ་ཡི། །རྫུ་འཕྲུལ་རྐང་པ་རབ་ཏུ་བསྟན། །
en: “The attainment of the power of mind Is shown to be the bases of miracles.

source: ཆགས་པ་ཀུན་ལས་རབ་འདས་པ། །དེ་ནི་དད་པའི་དབང་པོ་ཡིན། །
en: The complete transcendence of attachment Is the faculty of faith.

source: ཆོས་རྣམས་ཐམས་ཅད་རྣམ་དབེན་པ། །དེ་ནི་བརྩོན་འགྲུས་དབང་པོ་ཡིན། །
en: “Isolation from all phenomena Is the faculty of diligence.

source: དྲན་པ་མེད་ཅིང་དྲན་འཇུག་པ། །དེ་ནི་དྲན་པའི་དབང་པོ་ཡིན། །
en: Utilizing mindfulness and non-mindfulness Is the faculty of mindfulness.

source: ཆོས་རྣམས་ཡིད་ལ་མི་བྱེད་པ། །དེ་ནི་ཏིང་འཛིན་དབང་པོ་ཡིན། །
en: “Not mentally considering phenomena Is the faculty of absorption.

source: སྤྲོས་ལས་ཤིན་ཏུ་རབ་འདས་པ། །དེ་ནི་ཤེས་རབ་དབང་པོ་ཡིན། །
en: Transcending all conceptual thought Is the faculty of insight.

source: ཡང་དག་ཉིད་ནི་རྟོགས་ནས་དེ། །གཞན་གྱི་དད་པས་འགྲོ་མ་ཡིན། །
en: “Realization of reality Is not approached through the faith of others.

source: སེམས་ནི་གཡོ་བ་ཡོད་མིན་པ། །དད་པའི་སྟོབས་ནི་འདི་འདྲའོ། །
en: The absence of movement in the mind— That is what the power of faith is like.

source: ཡང་དག་ཤེས་ལས་ཉམས་པ་མེད། །དྲན་པའི་སྟོབས་ནི་འདི་འདྲའོ། །
en: “Authentic knowing unwaning— That is what the power of mindfulness is like.

source: ཏིང་ངེ་འཛིན་གྱི་སྟོབས་མཛོད་ནི། །དེས་པར་སེམས་ལ་དགའ་བ་ཡིན། །
en: The treasury of the power of absorption Is taking joy in the gentle mind.

source: མི་རྟོག་རྣམ་པར་མི་རྟོག་པ། །ཤེས་རབ་སྟོབས་ནི་འདི་འདྲའོ། །
en: “Non-thought and non-conception— That is what the power of insight is like.

source: ཆོས་རྣམས་རྟོགས་པའི་དོན་དུ་ནི། །བྱང་ཆུབ་ཡན་ལག་རབ་ཏུ་བསྟན། །
en: The branches of awakening are revealed In order to realize all phenomena.

source: མཉམ་སྟེ་མི་མཉམ་མེད་པའི་ཆོས། །
en: The Dharma of sameness beyond difference.

source: ཡང་དག་ལྟ་བ་ཡིན་ཞེས་བརྗོད། །
en: “The authentic view is claimed to be

source: གཉིས་མེད་ཆོས་ལ་བསྒོམ་པ་ནི། །སྐྱེ་བ་མེད་པའི་ལམ་བསྒོམ་ཡིན། །
en: The cultivation of nondual phenomena Is the cultivation of the unborn path.

source: སྐྱེ་བ་མེད་པ་མི་རྟག་དོན། །
en: “ Unborn entails impermanence;

source: འབྱུང་བ་མེད་པ་སྡུག་བསྔལ་ཏེ། །
en: Unarisen —suffering;

source: རྒྱུ་བ་མེད་པ་བདག་མེད་དོན། །
en: Unmoving —selflessness;

source: ཞི་དོན་ཉེ་བར་ཞི་བའི་གནས། །
en: Peace —the abode of peace.

source: དུལ་བའི་སེམས་ནི་སྦྱིན་པ་ཡིན། །
en: “Generosity is a gentle mind.

source: ཞི་བའི་སེམས་ནི་ཚུལ་ཁྲིམས་ལྡན། །
en: Discipline is a peaceful mind.

source: ཟད་པའི་ཆོས་རྟོགས་བཟོད་པ་ཡིན། །
en: Patience is the realization of the exhaustion of phenomena.

source: བརྩོན་འགྲུས་རྣམ་པར་ཕྱེ་བས་རྟོགས། །
en: Diligence is discriminating realization.

source: ཤིན་ཏུ་ཞི་བའི་བསམ་གཏན་ཏེ། །
en: “Concentration is absolute peace.

source: ཤེས་རབ་ཡང་དག་རབ་ཤེས་པ། །
en: Insight is to know reality.

source: སེམས་ཅན་གདོད་ནས་རྣམ་དག་དོན། །
en: That all beings are primordially pure.

source: བྱམས་པ་ཞེས་ནི་བརྗོད་པ་ཡིན། །
en: Love is described as the fact

source: སྙིང་རྗེ་ནམ་མཁའ་འདྲ་བ་སྟེ། །
en: “Compassion is like space.

source: དགའ་བ་སྤྱོད་པ་དགའ་བ་ཡིན། །
en: Joy is to delight in action.

source: རྩོམ་པ་ཐམས་ཅད་རྒྱུན་ཆད་པ། །བཏང་སྙོམས་ཞེས་ནི་རབ་ཏུ་བསྟན། །
en: Equanimity is described as Bringing an end to all endeavors.

source: འཁོར་གསུམ་ཡོངས་སུ་ཆད་པར་ནི། །
en: Are stripped of the three spheres

source: ཆོས་རྣམས་ཐམས་ཅད་རབ་ཏུ་ཤེས། །
en: “The knowledge that all phenomena

source: ཆོས་རྣམས་ངེས་པར་འབིགས་འདི་ནི། །ལྟ་བའི་མདུད་པ་གཅོད་པ་ཡིན། །
en: Is the genuine certainty of phenomena That cuts the knot of views.

source: བསམ་གཏན་ཤེས་རབ་གང་ཡིན་པ། །དེར་ནི་ངེས་པར་འབིགས་པ་བསྟན། །
en: “Genuine certainty is revealed In concentration and insight.

source: ཚད་མེད་པ་ལ་འཇུག་པ་ནི། །ཆོས་ཤེས་པ་ཞེས་བརྗོད་པ་ཡིན། །
en: Dharma knowledge is described As the experience of the immeasurable.”

source: གནོད་པ་བཟོད་པ་དང་ངེས་པར་འབིགས་པ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་གཉིས་པའོ།། །།
en: [Chapter Three: Accepting Harm and Gaining Certainty]

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One then spoke to the bodhisattva great being Sāgaramati:

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟར་ན་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་པ་དང་ཡོངས་སུ་དག་པར་འགྱུར་ཏེབསམ་པ་བཅོས་མ་མ་ཡིན་ཞིང་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་གནོད་པར་བྱས་ཀྱང་ཞེ་འགྲས་པ་མེད་ལ།
en: “Along these lines, Sāgaramati, when bodhisattva great beings become completely pure, they have a genuinely good motivation and, even if all beings were to rise up to challenge them, they would not be angered.

source: ཤིན་ཏུ་ངེས་པར་ཕིགས་པའི་ཡེ་ཤེས་སུ་གྱུར་ཅིང་། ཤེས་རབ་རྣམ་པར་གདོན་མི་ཟ་བ་ཐོབ་པ་དེའི་ཚེ།
en: They develop the wisdom of deep certainty and the insight free from doubt.

source: ཤིན་ཏུ་དཀར་བ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་གྱི་རྩ་བའི་གནས་ལ་རབ་ཏུ་གནས་པ་ཡིན་ནོ། །
en: At that time, they sustain the fundamental state of the pristine and immaculate absorption seal.

source: དེ་ལ་ཏིང་ངེ་འཛིན་འདིའི་རྩ་བའི་གནས་གང་ཞེ་ན།
en: What is the fundamental state of this absorption?
